app/views/gossips/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
   <div class="card-body" style="background-color: #2B2F2F;">
    <h3 class="card-title"><%= gossip.user.first_name %></h3>