app/views/gossips/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    <div class="card-header">
      <%= @find.user.first_name %> <%= @find.user.last_name %>