app/controllers/gossips_controller.rb

  def show
    @find = Gossip.find(params[:id])
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @gossip = Gossip.new(title: params[:title], content: params[:content], user_id: 4) # avec xxx qui sont les données obtenues à partir du formulaire

  if @gossip.save # essaie de sauvegarder en base @gossip
---
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "jidhfuzdgf"], ["content", "efefeefeeef"], ["user_id", 4], ["created_at", "2019-08-08 13:39:14.151200"], ["updated_at", "2019-08-08 13:39:14.151200"]]